<div style="padding:20px; 
            height: 30px;
            width: 500px;
            color:#36FF00;
            margin:10px;
            font-size:110%;
            display:fill;
            border-radius:10px;
            border-style: solid;
            border-color: #36FF00;
            background-color:#000000;
            overflow:hidden;
            font-weight:500">
            Pandas
            </div>

Pandas Python Package

<code style="background:yellow;color:red">Panel Data Frame</code>

<code style="background:red;color:white">
Let's Go!
</code>

In [1]:
import numpy as np
import pandas as pd

<code style="background:yellow;color:red">Pandas Series</code>

In [2]:
mydict = {"Toygar": 50, "Böçüş": 10, "Taco": 17, "Buzz": 23, "Çıtır": 16}

In [3]:
#nasıl series oluşturulur

pd.Series(mydict)

Toygar    50
Böçüş     10
Taco      17
Buzz      23
Çıtır     16
dtype: int64

In [4]:
type(pd.Series(mydict))

pandas.core.series.Series

In [5]:
names = ["Toygar", "Böçüş", "Taco", "Buzz", "Çıtır"]

ages = [50, 10, 17, 23, 16]

In [6]:
pd.Series(ages)

0    50
1    10
2    17
3    23
4    16
dtype: int64

In [7]:
pd.Series(ages, names) #index olarak names listesini kullandık

Toygar    50
Böçüş     10
Taco      17
Buzz      23
Çıtır     16
dtype: int64

In [8]:
pd.Series(data=ages, index=names) #yukarıdaki ile aynı işlemi yaptık, parametreleri isimlendirerek verdik , pd.Series(data=, index=)

Toygar    50
Böçüş     10
Taco      17
Buzz      23
Çıtır     16
dtype: int64

In [9]:
npdizi = np.array(ages)
npdizi

array([50, 10, 17, 23, 16])

In [10]:
pd.Series(npdizi)

0    50
1    10
2    17
3    23
4    16
dtype: int64

In [11]:
pd.Series(npdizi, names)

Toygar    50
Böçüş     10
Taco      17
Buzz      23
Çıtır     16
dtype: int64

In [12]:
pd.Series(["Zehra Günes", "Marina Markova", "Kiera Van Ryk"])

0       Zehra Günes
1    Marina Markova
2     Kiera Van Ryk
dtype: object

In [13]:
pd.Series(["Zehra Günes", "Marina Markova", "Kiera Van Ryk"], [1,2,3])  #index olarak sayılar vererek biz belirledik

1       Zehra Günes
2    Marina Markova
3     Kiera Van Ryk
dtype: object

In [14]:
standing =  pd.Series([10,5,1],["Zehra Günes", "Marina Markova", "Kiera Van Ryk"])

standing

Zehra Günes       10
Marina Markova     5
Kiera Van Ryk      1
dtype: int64

In [15]:
standing2 = pd.Series([20,10,8],["Zehra Günes", "Marina Markova", "Kiera Van Ryk"])
standing2

Zehra Günes       20
Marina Markova    10
Kiera Van Ryk      8
dtype: int64

In [16]:
standing2["Zehra Günes"]

20

In [17]:
final_standings = standing + standing2

final_standings

Zehra Günes       30
Marina Markova    15
Kiera Van Ryk      9
dtype: int64

In [18]:
seri = pd.Series([30,40,50,60], ["a","b", "c", "d"])
seri

a    30
b    40
c    50
d    60
dtype: int64

In [19]:
seri2 = pd.Series([60,70,80,90],["a", "c","f","g"])
seri2

a    60
c    70
f    80
g    90
dtype: int64

In [20]:
seri + seri2  #sadece a ve c olanlar toplandı, diğerleri NaN oldu, a ve c kesiştiği için toplandı, diğerleri toplanamadı

a     90.0
b      NaN
c    120.0
d      NaN
f      NaN
g      NaN
dtype: float64

<code style="background:yellow;color:red">Data Frame</code>

In [21]:
import numpy as np
import pandas as pd

In [22]:
np.random.randn

In [23]:
data = np.random.randn(4,3)
data

array([[-3.87517077e-04,  5.00694768e-01, -7.22379930e-01],
       [ 7.05139341e-01, -4.45267838e-01, -2.47937978e-01],
       [-6.73068058e-01, -1.65120543e-02, -1.18859451e+00],
       [ 9.23517407e-01,  1.88333386e-01,  8.65369971e-01]])

In [24]:
df = pd.DataFrame(data)
df

          0         1         2
0 -0.000388  0.500695 -0.722380
1  0.705139 -0.445268 -0.247938
2 -0.673068 -0.016512 -1.188595
3  0.923517  0.188333  0.865370

In [ ]:
df[0]

0   -0.000388
1    0.705139
2   -0.673068
3    0.923517
Name: 0, dtype: float64

In [26]:
type(df[0])

pandas.core.series.Series

In [27]:
df= pd.DataFrame(data, index=["Toygar", "Böçüş", "Taco", "Buzz"], columns=["Maaş","Yaş","Çalışma Saati"])
df

            Maaş       Yaş  Çalışma Saati
Toygar -0.000388  0.500695      -0.722380
Böçüş   0.705139 -0.445268      -0.247938
Taco   -0.673068 -0.016512      -1.188595
Buzz    0.923517  0.188333       0.865370

In [28]:
df["Yaş"]

Toygar    0.500695
Böçüş    -0.445268
Taco     -0.016512
Buzz      0.188333
Name: Yaş, dtype: float64

In [29]:
df["Çalışma Saati"]

Toygar   -0.722380
Böçüş    -0.247938
Taco     -1.188595
Buzz      0.865370
Name: Çalışma Saati, dtype: float64

In [30]:
df[["Maaş","Yaş"]]

            Maaş       Yaş
Toygar -0.000388  0.500695
Böçüş   0.705139 -0.445268
Taco   -0.673068 -0.016512
Buzz    0.923517  0.188333

In [31]:
#belirli bir rowu seçmek için

df.loc["Toygar"]

Maaş            -0.000388
Yaş              0.500695
Çalışma Saati   -0.722380
Name: Toygar, dtype: float64

In [32]:
df.loc["Buzz"]

Maaş             0.923517
Yaş              0.188333
Çalışma Saati    0.865370
Name: Buzz, dtype: float64

In [33]:
df.iloc[0]  #index numarası ile row seçmek için

Maaş            -0.000388
Yaş              0.500695
Çalışma Saati   -0.722380
Name: Toygar, dtype: float64

In [34]:
df.iloc[3]

Maaş             0.923517
Yaş              0.188333
Çalışma Saati    0.865370
Name: Buzz, dtype: float64

In [35]:
df

            Maaş       Yaş  Çalışma Saati
Toygar -0.000388  0.500695      -0.722380
Böçüş   0.705139 -0.445268      -0.247938
Taco   -0.673068 -0.016512      -1.188595
Buzz    0.923517  0.188333       0.865370

In [36]:
df["Emeklilik Yaşı"] = df["Yaş"] + df["Yaş"] #yeni bir column ekledik
df

            Maaş       Yaş  Çalışma Saati  Emeklilik Yaşı
Toygar -0.000388  0.500695      -0.722380        1.001390
Böçüş   0.705139 -0.445268      -0.247938       -0.890536
Taco   -0.673068 -0.016512      -1.188595       -0.033024
Buzz    0.923517  0.188333       0.865370        0.376667

In [37]:
df.drop("Emeklilik Yaşı", axis=1) #column silmek için, y axis=1 column demek, x axis=0 row demek, default olarak axis=0

            Maaş       Yaş  Çalışma Saati
Toygar -0.000388  0.500695      -0.722380
Böçüş   0.705139 -0.445268      -0.247938
Taco   -0.673068 -0.016512      -1.188595
Buzz    0.923517  0.188333       0.865370

In [38]:
df.drop("Böçüş", axis=0) #row silmek için

            Maaş       Yaş  Çalışma Saati  Emeklilik Yaşı
Toygar -0.000388  0.500695      -0.722380        1.001390
Taco   -0.673068 -0.016512      -1.188595       -0.033024
Buzz    0.923517  0.188333       0.865370        0.376667

In [39]:
df

            Maaş       Yaş  Çalışma Saati  Emeklilik Yaşı
Toygar -0.000388  0.500695      -0.722380        1.001390
Böçüş   0.705139 -0.445268      -0.247938       -0.890536
Taco   -0.673068 -0.016512      -1.188595       -0.033024
Buzz    0.923517  0.188333       0.865370        0.376667

In [40]:
df.drop("Emeklilik Yaşı", axis=1, inplace=True) #kalıcı olarak silmek için inplace=True yapmalıyız

In [41]:
df

            Maaş       Yaş  Çalışma Saati
Toygar -0.000388  0.500695      -0.722380
Böçüş   0.705139 -0.445268      -0.247938
Taco   -0.673068 -0.016512      -1.188595
Buzz    0.923517  0.188333       0.865370

In [42]:
df.loc["Toygar"]["Maaş"] #row ve column seçmek için, Toygar rowu ve Maaş columnu seçtik

-0.0003875170772907675

In [43]:
df.loc["Toygar","Maaş"] #yukarıdaki ile aynı işlemi yaptık, bu şekilde de seçim yapabiliriz

-0.0003875170772907675

In [44]:
df.loc[["Toygar","Böçüş"],["Maaş","Yaş"]] #birden fazla row ve column seçmek için

            Maaş       Yaş
Toygar -0.000388  0.500695
Böçüş   0.705139 -0.445268

In [45]:
df > 0 #dataframe içindeki değerlerin 0 dan büyük olup olmadığını kontrol eder

         Maaş    Yaş  Çalışma Saati
Toygar  False   True          False
Böçüş    True  False          False
Taco    False  False          False
Buzz     True   True           True

In [46]:
df[df>0] #0 dan büyük olan değerleri getirir, 0 dan küçük olanlar NaN olur

            Maaş       Yaş  Çalışma Saati
Toygar       NaN  0.500695            NaN
Böçüş   0.705139       NaN            NaN
Taco         NaN       NaN            NaN
Buzz    0.923517  0.188333        0.86537

In [47]:
df["Yaş"] > 0 #Yaş columnundaki değerlerin 0'dan büyük olup olmadığını kontrol eder

Toygar     True
Böçüş     False
Taco      False
Buzz       True
Name: Yaş, dtype: bool

In [48]:
df[df["Yaş"] > 0] #Yaş columnundaki değeri 0'dan büyük olan rowları getirir

            Maaş       Yaş  Çalışma Saati
Toygar -0.000388  0.500695       -0.72238
Buzz    0.923517  0.188333        0.86537

In [49]:
df[df["Yaş"] > 0]["Maaş"] #Yaş columnundaki değeri 0'dan büyük olan rowların Maaş columnunu getirir, filtrelemek ve istediğimiz dataları bulmak için kullanılır

Toygar   -0.000388
Buzz      0.923517
Name: Maaş, dtype: float64

<code style="background:yellow;color:red">Index Değiştirme</code>

In [50]:
df.reset_index() #indexleri sıfırlar, default olarak inplace=False

    index      Maaş       Yaş  Çalışma Saati
0  Toygar -0.000388  0.500695      -0.722380
1   Böçüş  0.705139 -0.445268      -0.247938
2    Taco -0.673068 -0.016512      -1.188595
3    Buzz  0.923517  0.188333       0.865370

In [51]:
df

            Maaş       Yaş  Çalışma Saati
Toygar -0.000388  0.500695      -0.722380
Böçüş   0.705139 -0.445268      -0.247938
Taco   -0.673068 -0.016512      -1.188595
Buzz    0.923517  0.188333       0.865370

In [52]:
yeni_index_listesi = ["Toy", "Böc", "Tac", "Buz"] #yeni index listesi oluşturduk

In [53]:
yeni_index_listesi = ["Toy", "Böc", "Tac", "Buz"] 
df["Yeni Index"] = yeni_index_listesi #yeni index listesini dataframe'e ekledik
df

            Maaş       Yaş  Çalışma Saati Yeni Index
Toygar -0.000388  0.500695      -0.722380        Toy
Böçüş   0.705139 -0.445268      -0.247938        Böc
Taco   -0.673068 -0.016512      -1.188595        Tac
Buzz    0.923517  0.188333       0.865370        Buz

In [54]:
df.set_index("Yeni Index") #indexi değiştirmek için

                Maaş       Yaş  Çalışma Saati
Yeni Index
Toy        -0.000388  0.500695      -0.722380
Böc         0.705139 -0.445268      -0.247938
Tac        -0.673068 -0.016512      -1.188595
Buz         0.923517  0.188333       0.865370

In [55]:
df.set_index("Yeni Index", inplace=True) #kalıcı olarak indexi değiştirmek için

In [56]:
df

                Maaş       Yaş  Çalışma Saati
Yeni Index
Toy        -0.000388  0.500695      -0.722380
Böc         0.705139 -0.445268      -0.247938
Tac        -0.673068 -0.016512      -1.188595
Buz         0.923517  0.188333       0.865370

In [57]:
df.loc["Toy"] #yeni index ile row seçmek için

Maaş            -0.000388
Yaş              0.500695
Çalışma Saati   -0.722380
Name: Toy, dtype: float64

<code style="background:yellow;color:red">Multi Index</code>

In [58]:
first_indices = ["Vakıfbank","Vakıfbank","Vakıfbank", "Eczacıbaşı","Eczacıbaşı","Eczacıbaşı"]
inner_indices = ["Zehra Güneş", "Marina Markova","Kiera Van Ryk","Tijana Boskovic","Hande Baladin","Elif Şahin"]

In [59]:
#iki indexin birleşimi ile dataframe oluşturmaya dair kullanmak için zip fonksiyonunu kullanabiliriz

united_index = list(zip(first_indices, inner_indices))

united_index

[('Vakıfbank', 'Zehra Güneş'),
 ('Vakıfbank', 'Marina Markova'),
 ('Vakıfbank', 'Kiera Van Ryk'),
 ('Eczacıbaşı', 'Tijana Boskovic'),
 ('Eczacıbaşı', 'Hande Baladin'),
 ('Eczacıbaşı', 'Elif Şahin')]

In [60]:
united_index = pd.MultiIndex.from_tuples(united_index) #multi index  oluşturduk,  pd.MultiIndex.from_tuples() fonksiyonu ile

In [61]:
united_index

MultiIndex([( 'Vakıfbank',     'Zehra Güneş'),
            ( 'Vakıfbank',  'Marina Markova'),
            ( 'Vakıfbank',   'Kiera Van Ryk'),
            ('Eczacıbaşı', 'Tijana Boskovic'),
            ('Eczacıbaşı',   'Hande Baladin'),
            ('Eczacıbaşı',      'Elif Şahin')],
           )

In [62]:
position_list = [[25, "Middle Blocker"],[21, "Opposite"],[21, "Opposite Attacker"],[24, "Opposite Attacker"],[22, "Opposite"],[20, "Setter"]]   #pozisyon listesi oluşturduk

In [63]:
pos_np_list = np.array(position_list)  #pozisyon listesini numpy arrayine çevirdik

pos_np_list

array([['25', 'Middle Blocker'],
       ['21', 'Opposite'],
       ['21', 'Opposite Attacker'],
       ['24', 'Opposite Attacker'],
       ['22', 'Opposite'],
       ['20', 'Setter']], dtype='<U21')

In [64]:
df = pd.DataFrame(pos_np_list, index=united_index, columns=["Age", "Position"]) #dataframe oluşturduk

df

                           Age           Position
Vakıfbank  Zehra Güneş      25     Middle Blocker
           Marina Markova   21           Opposite
           Kiera Van Ryk    21  Opposite Attacker
Eczacıbaşı Tijana Boskovic  24  Opposite Attacker
           Hande Baladin    22           Opposite
           Elif Şahin       20             Setter

In [65]:
df.loc["Vakıfbank"] #Vakıfbank rowlarını getirir

               Age           Position
Zehra Güneş     25     Middle Blocker
Marina Markova  21           Opposite
Kiera Van Ryk   21  Opposite Attacker

In [66]:
df.loc["Eczacıbaşı"] #Eczacıbaşı rowlarını getirir

                Age           Position
Tijana Boskovic  24  Opposite Attacker
Hande Baladin    22           Opposite
Elif Şahin       20             Setter

In [67]:
df.loc["Vakıfbank"].loc["Marina Markova"] #Vakıfbank rowlarından Marina Markova'yı getirir

Age               21
Position    Opposite
Name: Marina Markova, dtype: object

In [68]:
df.index.names = ["Team", "Player"] #multi indeksin index isimlerini değiştirdik

df

                           Age           Position
Team       Player
Vakıfbank  Zehra Güneş      25     Middle Blocker
           Marina Markova   21           Opposite
           Kiera Van Ryk    21  Opposite Attacker
Eczacıbaşı Tijana Boskovic  24  Opposite Attacker
           Hande Baladin    22           Opposite
           Elif Şahin       20             Setter

<code style="background:yellow;color:red">Operasyonlar - Örn:Eksik Veriler</code>

In [69]:
import numpy as np
import pandas as pd

In [70]:
df = pd.DataFrame({"İstanbul": [30,29,np.nan,31,28,27], "Ankara": [20,np.nan,20,19,22,21], "İzmir": [25,26,27,28,29,30]}, index=["Pazartesi","Salı","Çarşamba","Perşembe","Cuma","Cumartesi"])
#hava durumu dataframe'i oluşturduk, NaN değerler var, ilk önce dictionary ile veriyi oluşturduk,sonra index isimlerini verdik
#index vermeseydik sonradan set_index() fonksiyonu ile verebilirdik
df

           İstanbul  Ankara  İzmir
Pazartesi      30.0    20.0     25
Salı           29.0     NaN     26
Çarşamba        NaN    20.0     27
Perşembe       31.0    19.0     28
Cuma           28.0    22.0     29
Cumartesi      27.0    21.0     30

In [71]:
df.dropna() #NaN değerleri olan rowları siler, default olarak axis=0

           İstanbul  Ankara  İzmir
Pazartesi      30.0    20.0     25
Perşembe       31.0    19.0     28
Cuma           28.0    22.0     29
Cumartesi      27.0    21.0     30

In [72]:
df

           İstanbul  Ankara  İzmir
Pazartesi      30.0    20.0     25
Salı           29.0     NaN     26
Çarşamba        NaN    20.0     27
Perşembe       31.0    19.0     28
Cuma           28.0    22.0     29
Cumartesi      27.0    21.0     30

In [73]:
df.dropna(axis=1) #NaN değerleri olan columnları siler, axis=1, column bazında, np.nan olmayan değerlerin olduğu columnları getirir

           İzmir
Pazartesi     25
Salı          26
Çarşamba      27
Perşembe      28
Cuma          29
Cumartesi     30

In [74]:
yeni_df = pd.DataFrame({"İstanbul": [30,29,np.nan,31,28,27], "Ankara": [20,np.nan,20,19,22,21], "İzmir": [25,26,27,28,29,30], "Antalya": [30,31,np.nan,np.nan,np.nan,30]}, index=["Pazartesi","Salı","Çarşamba","Perşembe","Cuma","Cumartesi"])

yeni_df

           İstanbul  Ankara  İzmir  Antalya
Pazartesi      30.0    20.0     25     30.0
Salı           29.0     NaN     26     31.0
Çarşamba        NaN    20.0     27      NaN
Perşembe       31.0    19.0     28      NaN
Cuma           28.0    22.0     29      NaN
Cumartesi      27.0    21.0     30     30.0

In [75]:

#The thresh parameter specifies the minimum number of non-NaN values required to keep a column. if thresh =4, it means that the column must have at least 4 non-NaN values to be kept.

yeni_df.dropna(axis=1, thresh=4) #kolonlarda en az 2 tane np.nan varsa o kolonu siler, diğer kolonları bırakır

           İstanbul  Ankara  İzmir
Pazartesi      30.0    20.0     25
Salı           29.0     NaN     26
Çarşamba        NaN    20.0     27
Perşembe       31.0    19.0     28
Cuma           28.0    22.0     29
Cumartesi      27.0    21.0     30

In [76]:
#boş verilere standart bir değer atamak için fillna() fonksiyonunu kullanabiliriz
yeni_df.fillna(value=25) #NaN değerlere 25 değerini atadık

           İstanbul  Ankara  İzmir  Antalya
Pazartesi      30.0    20.0     25     30.0
Salı           29.0    25.0     26     31.0
Çarşamba       25.0    20.0     27     25.0
Perşembe       31.0    19.0     28     25.0
Cuma           28.0    22.0     29     25.0
Cumartesi      27.0    21.0     30     30.0

<code style="background:yellow;color:red">Group By</code>

rowları yani sıraları gruplar. multi indekse benzer bir gruplandırma yaparak herhangi bir kolondan gruplandırma gerçekleştiriyoruz

In [77]:
import numpy as np
import pandas as pd

In [78]:
wages_dict = {"Departman": ["Yazılım", "Satış", "Finans", "İK", "Hukuk", "Üretim"], "Çalısan": ["Toygar", "Böçüş", "Taco", "Buzz", "Çıtır", "Kocakafa"], "Maas": [10000,20000,30000,40000,50000,60000]}

In [79]:
df = pd.DataFrame(wages_dict) #dataframe'i wages_dict ile oluşturduk

df

  Departman   Çalısan   Maas
0   Yazılım    Toygar  10000
1     Satış     Böçüş  20000
2    Finans      Taco  30000
3        İK      Buzz  40000
4     Hukuk     Çıtır  50000
5    Üretim  Kocakafa  60000

In [80]:
wages = {"Departman": ["Yazılım", "Yazılım", "Finans", "Finans", "IK", "IK"], "Çalısan": ["Toygar", "Böçüş", "Taco", "Buzz", "Çıtır", "Kocakafa"], "Maas": [10000,20000,30000,40000,50000,60000]}

In [81]:
df= pd.DataFrame(wages) #dataframe'i wages ile oluşturduk

In [82]:
df

  Departman   Çalısan   Maas
0   Yazılım    Toygar  10000
1   Yazılım     Böçüş  20000
2    Finans      Taco  30000
3    Finans      Buzz  40000
4        IK     Çıtır  50000
5        IK  Kocakafa  60000

In [83]:
df.groupby("Departman") # departmana göre grupladık

In [84]:
dep_obj= df.groupby("Departman") #departmana göre grupladık ve dep_obj değişkenine atadık
dep_obj

In [85]:
dep_obj.count() #departmanlara göre kaç tane çalışan olduğunu getirir

           Çalısan  Maas
Departman
Finans           2     2
IK               2     2
Yazılım          2     2

In [86]:
dep_obj["Maas"].mean() #departmanlara göre maaş ortalamasını getirir

Departman
Finans     35000.0
IK         55000.0
Yazılım    15000.0
Name: Maas, dtype: float64

In [87]:
df["Maas"].mean() #tüm maaşların ortalamasını getirir

35000.0

In [88]:
dep_obj.describe().T #departmanlara göre maaşların istatistiksel bilgilerini getirir

Departman         Finans            IK       Yazılım
Maas count      2.000000      2.000000      2.000000
     mean   35000.000000  55000.000000  15000.000000
     std     7071.067812   7071.067812   7071.067812
     min    30000.000000  50000.000000  10000.000000
     25%    32500.000000  52500.000000  12500.000000
     50%    35000.000000  55000.000000  15000.000000
     75%    37500.000000  57500.000000  17500.000000
     max    40000.000000  60000.000000  20000.000000

In [89]:
dep_obj.describe() #departmanlara göre maaşların istatistiksel bilgilerini getirir

           Maas                                                            \
          count     mean          std      min      25%      50%      75%
Departman
Finans      2.0  35000.0  7071.067812  30000.0  32500.0  35000.0  37500.0
IK          2.0  55000.0  7071.067812  50000.0  52500.0  55000.0  57500.0
Yazılım     2.0  15000.0  7071.067812  10000.0  12500.0  15000.0  17500.0


               max
Departman
Finans     40000.0
IK         60000.0
Yazılım    20000.0

In [90]:
dep_obj.max() #departmanlara göre en yüksek maaşı getirir

          Çalısan   Maas
Departman
Finans       Taco  40000
IK          Çıtır  60000
Yazılım    Toygar  20000

In [91]:
dep_obj.min() #departmanlara göre en düşük maaşı getirir

            Çalısan   Maas
Departman
Finans         Buzz  30000
IK         Kocakafa  50000
Yazılım       Böçüş  10000

In [92]:
dep_obj["Maas"].mean() #departmanlara göre maaş ortalamasını getirir

Departman
Finans     35000.0
IK         55000.0
Yazılım    15000.0
Name: Maas, dtype: float64

<code style="background:yellow;color:red">Concat</code>

farklı farklı dflerle birleştirmek, yan yana koymak, beraber bakmak

In [93]:
vakifbank = { "Player": ["Zehra Güneş", "Marina Markova", "Kiera Van Ryk", "Cansu Özbay"], "Position": ["Middle Blocker", "Opposite", "Opposite Attacker","Setter"], "Scored": [150,355,326,100]}          
             
eczacibasi = { "Player": ["Tijana Boskovic", "Hande Baladin", "Dana Rettke", "Elif Şahin"], "Position": ["Opposite Attacker", "Opposite","Middle Blocker", "Setter"], "Scored": [450,300,250,200]}

fenerbahce = { "Player": ["Eda Erdem", "Meliha İsmailoğlu", "Melisa Vargas","Boyana Dryca"], "Position": ["Middle Blocker", "Opposite", "Opposite Attacker","Setter"], "Scored": [200,250,500,125]}

In [94]:
df1 = pd.DataFrame(vakifbank, index= [1,2,3,4]) #vakıfbank dataframe'i için index vererek oluşturduk
df2 = pd.DataFrame(eczacibasi, index = [5,6,7,8]) #eczacıbaşı dataframe'i için index vererek oluşturduk
df3 = pd.DataFrame(fenerbahce, index = [9,10,11,12]) #fenerbahçe dataframe'i için index vererek oluşturduk

In [95]:
df1

           Player           Position  Scored
1     Zehra Güneş     Middle Blocker     150
2  Marina Markova           Opposite     355
3   Kiera Van Ryk  Opposite Attacker     326
4     Cansu Özbay             Setter     100

In [96]:
df2

            Player           Position  Scored
5  Tijana Boskovic  Opposite Attacker     450
6    Hande Baladin           Opposite     300
7      Dana Rettke     Middle Blocker     250
8       Elif Şahin             Setter     200

In [97]:
df3

               Player           Position  Scored
9           Eda Erdem     Middle Blocker     200
10  Meliha İsmailoğlu           Opposite     250
11      Melisa Vargas  Opposite Attacker     500
12       Boyana Dryca             Setter     125

In [98]:
#concat() fonksiyonu ile dataframe'leri birleştirebiliriz - concatenation

pd.concat([df1,df2,df3]) #dataframe'leri birleştirdik, default olarak axis=0, row bazında birleştirir, axis=1 deseydik hepsini yanyana birleştirirdi

               Player           Position  Scored
1         Zehra Güneş     Middle Blocker     150
2      Marina Markova           Opposite     355
3       Kiera Van Ryk  Opposite Attacker     326
4         Cansu Özbay             Setter     100
5     Tijana Boskovic  Opposite Attacker     450
6       Hande Baladin           Opposite     300
7         Dana Rettke     Middle Blocker     250
8          Elif Şahin             Setter     200
9           Eda Erdem     Middle Blocker     200
10  Meliha İsmailoğlu           Opposite     250
11      Melisa Vargas  Opposite Attacker     500
12       Boyana Dryca             Setter     125

<code style="background:yellow;color:red">Merge</code>

kaynaştırmak

In [99]:
vakifbank1 = { "Player": ["Zehra Güneş", "Marina Markova", "Kiera Van Ryk", "Cansu Özbay"], "Position": ["Middle Blocker", "Opposite", "Opposite Attacker","Setter"]}
vakifbank2 = { "Player": ["Zehra Güneş", "Marina Markova", "Kiera Van Ryk", "Cansu Özbay"],  "Scored": [150,355,326,100]}

#iki farklı dictionary ile vakıfbank dataframe'ini oluşturucağız, merge işlemi yapacağız, ortak bir column üzerinden birleştireceğiz

In [100]:
vdf = pd.merge(pd.DataFrame(vakifbank1), pd.DataFrame(vakifbank2)) #merge işlemi yaptık, default olarak inner join yaptı, ortak column üzerinden birleştirdi

In [101]:
vdf    #By default, pd.merge performs an inner join, meaning only rows with matching Player values in both DataFrames are included in the result, Default Merge Type (how="inner")

           Player           Position  Scored
0     Zehra Güneş     Middle Blocker     150
1  Marina Markova           Opposite     355
2   Kiera Van Ryk  Opposite Attacker     326
3     Cansu Özbay             Setter     100

Handling Non-Matching Rows: If the Player columns in the two dictionaries contained non-matching rows, you could handle them using different merge types (how parameter):

how="left": Keeps all rows from the left DataFrame (vakifbank1), adding NaN where there is no match.   
how="right": Keeps all rows from the right DataFrame (vakifbank2), adding NaN where there is no match.   
how="outer": Keeps all rows from both DataFrames, filling in NaN for missing matches.



When duplicate columns exist, you can prevent pandas from adding the default _x and _y suffixes, you can explicitly specify custom suffixes with the suffixes parameter.

```vdf = pd.merge(vakifbank, vakifbank2, on="Player", suffixes=("_old", "_new"))```

In [102]:
vdf_on = pd.merge(pd.DataFrame(vakifbank1), pd.DataFrame(vakifbank2), on="Player") #merge işlemi yaptık, on parametresi ile hangi column üzerinden birleştireceğimizi belirttik

In [103]:
vdf_on

           Player           Position  Scored
0     Zehra Güneş     Middle Blocker     150
1  Marina Markova           Opposite     355
2   Kiera Van Ryk  Opposite Attacker     326
3     Cansu Özbay             Setter     100


<code style="background:yellow;color:red">Pandas İleri Operasyonlar</code>

bazı püf noktaları

In [104]:
wages_new = wages_dict.copy() #wages_dict'in kopyasını oluşturduk

In [105]:
wages_new["Departman"] = ["Yazılım", "Satış", "Finans", "İK"] #Departman columnunu değiştirdik

In [106]:
wages_new["Çalısan"] = ["Toygar", "Böçüş", "Taco", "Buzz"] #Çalısan columnunu değiştirdik

In [107]:
wages_new["Maas"] = [10000,20000,30000,40000] #Maas columnunu değiştirdik

In [108]:
df4 = pd.DataFrame(wages_new) #dataframe'i oluşturduk

df4

  Departman Çalısan   Maas
0   Yazılım  Toygar  10000
1     Satış   Böçüş  20000
2    Finans    Taco  30000
3        İK    Buzz  40000

In [109]:
df4["Departman"].iloc[3] = "Yazılım" #Departman columnundaki 3. indexi değiştirdik

/tmp/ipykernel_6461/581210123.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df4["Departman"].iloc[3] = "Yazılım" #Departman columnundaki 3. indexi değiştirdik
/tmp/ipykernel_6461/581210123.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4["Departman"].iloc[3] = "Yazılım" #Departman columnundaki 3. indexi değiştirdik

In [110]:
df4

  Departman Çalısan   Maas
0   Yazılım  Toygar  10000
1     Satış   Böçüş  20000
2    Finans    Taco  30000
3   Yazılım    Buzz  40000

In [111]:
df4["Departman"].unique() #Departman columnundaki unique değerleri getirir, unique() fonksiyonu ile

array(['Yazılım', 'Satış', 'Finans'], dtype=object)

In [112]:
df4["Departman"].nunique() #Departman columnundaki unique değerlerin sayısını getirir, nunique() fonksiyonu ile

3

In [113]:
df4["Departman"].value_counts() #Departman columnundaki unique değerlerin kaçar tane olduğunu getirir, value_counts() fonksiyonu ile

Departman
Yazılım    2
Satış      1
Finans     1
Name: count, dtype: int64

In [114]:
def grosstonet(maas):  #maaşın 0.66'sını getiren fonksiyon
    return maas*0.66

In [115]:
df["Maas"]

0    10000
1    20000
2    30000
3    40000
4    50000
5    60000
Name: Maas, dtype: int64

In [116]:
df["Maas"].apply(grosstonet) #apply() fonksiyonu ile bir fonksiyonu dataframe üzerinde uygulayabiliriz

0     6600.0
1    13200.0
2    19800.0
3    26400.0
4    33000.0
5    39600.0
Name: Maas, dtype: float64

In [117]:
#isnull() fonksiyonu ile NaN değerleri kontrol edebiliriz

df4.isnull() #NaN değerleri kontrol eder, NaN değerler True, non-NaN değerler False olur

   Departman  Çalısan   Maas
0      False    False  False
1      False    False  False
2      False    False  False
3      False    False  False

In [118]:
df4

  Departman Çalısan   Maas
0   Yazılım  Toygar  10000
1     Satış   Böçüş  20000
2    Finans    Taco  30000
3   Yazılım    Buzz  40000

In [119]:
#To count the number of NaN values:
df.isnull().sum() #NaN değerlerin toplam sayısını getirir

Departman    0
Çalısan      0
Maas         0
dtype: int64

In [120]:
#To filter rows with NaN values:
df[df.isnull().any(axis=1)] #NaN değerleri olan rowları getirir, any(axis=1) column bazında rowlarda en az bir tane NaN değer varsa o rowu getirir

Empty DataFrame
Columns: [Departman, Çalısan, Maas]
Index: []

In [121]:
#pivot_table() fonksiyonu ile veriyi pivot tablo haline getirebiliriz

df5 = pd.DataFrame({"A":["foo", "foo", "foo", "bar", "bar", "bar"], "B":["one", "one", "two", "two", "one", "one"], "C":[1,3,2,5,4,1]})

In [122]:
cartoon = { "Karakter Sınıfı": ["South Park", "South Park", "South Park", "Simpsons", "Simpsons", "Simpsons"], "Karakter": ["Cartman", "Kenny", "Kyle", "Homer", "Bart", "Marge"], "Karakter Yaş": [10,8,9,50,10,50]}

In [123]:
df6 = pd.DataFrame(cartoon)

df6

  Karakter Sınıfı Karakter  Karakter Yaş
0      South Park  Cartman            10
1      South Park    Kenny             8
2      South Park     Kyle             9
3        Simpsons    Homer            50
4        Simpsons     Bart            10
5        Simpsons    Marge            50

In [124]:
df6.pivot_table(values = "Karakter Yaş", index = ["Karakter Sınıfı", "Karakter"]) 

#pivot_table() fonksiyonu ile veriyi pivot tablo haline getirebiliriz, values parametresi ile hangi column üzerinden işlem yapacağımızı belirttik, index parametresi ile hangi columnların index olacağını belirttik

#df6.pivot_table(values = "Karakter Yaş", index = ["Karakter Sınıfı", "Karakter"], aggfunc=np.sum) #aggfunc parametresi ile hangi işlemi yapacağımızı belirttik, default olarak np.mean, np.sum, np.min, np.max, np.std, np.var, np.count gibi fonksiyonları kullanabiliriz

                          Karakter Yaş
Karakter Sınıfı Karakter
Simpsons        Bart              10.0
                Homer             50.0
                Marge             50.0
South Park      Cartman           10.0
                Kenny              8.0
                Kyle               9.0

In [125]:
df5

     A    B  C
0  foo  one  1
1  foo  one  3
2  foo  two  2
3  bar  two  5
4  bar  one  4
5  bar  one  1

In [126]:
df5.pivot_table(values = "C", index = ["A", "B"]) 

#pivot_table() fonksiyonu ile veriyi pivot tablo haline getirebiliriz, values parametresi ile hangi column üzerinden işlem yapacağımızı belirttik, index parametresi ile hangi columnların index olacağını belirttik, columns parametresi ile hangi columnların column olacağını belirttik

           C
A   B
bar one  2.5
    two  5.0
foo one  2.0
    two  2.0

In [127]:
#aggfunc parametresi ile hangi işlemi yapacağımızı belirtebiliriz, default olarak np.mean, np.sum, np.min, np.max, np.std, np.var, np.count gibi fonksiyonları kullanabiliriz

df5.pivot_table(values = "C", index = ["A", "B"], aggfunc=np.sum)

/tmp/ipykernel_6461/171006774.py:3: FutureWarning: The provided callable <function sum at 0x75ca80196ac0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df5.pivot_table(values = "C", index = ["A", "B"], aggfunc=np.sum)

         C
A   B
bar one  5
    two  5
foo one  4
    two  2